package com.Info;

public class Info {
    public void getInfo(){
        System.out.println("""
                Выбери действие, которое хотите запустить:
                [1] - Создать вектор.
                [2] - Вывести размер вектора.
                [3] - Занести значения в элементы вектора.
                [4] - Вывести все элементы вектора.
                [5] - Вывести определённый элемент вектора.
                [6] - Изменить определённый элемент вектора.
                [7] - Минимальное значение вектора.
                [8] - Максимальное значение вектора.
                [9] - Сортировка вектора по возрастанию.
                [10] - Сортировка вектора по убыванию.
                [11] - Поиск Евклидовой нормы.
                [12] - Умножение вектора на число.
                [13] - Сумма двух векторов.
                [14] - Умножение двух векторов.""");
    }
}